
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// 使用するシェーダーを保持するクラス
// 
// 
// 製作者	: amateurK
// 作成日	: 2024/11/30
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#include "ShaderSet.h"

namespace Shader
{

	ShaderSet::ShaderSet()
	{
		m_ShaderList.clear();
	}

	//--------------------------------------------------------------------------------------
	ShaderSet::~ShaderSet()
	{

	}

	//--------------------------------------------------------------------------------------
	void ShaderSet::SetShaders()
	{
		// 全シェーダーのシェーダーをセット
		for (auto& shader : m_ShaderList) {
			shader.second->SetShader();
		}
	}

	//--------------------------------------------------------------------------------------
	void ShaderSet::AddShader(ShaderType type, ShaderBase* shader)
	{
		m_ShaderList[type] = shader;
	}
}