
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// スキニングアニメーションを行うメッシュデータクラス
// 抽象クラス
// 
// 製作者	: amateurK
// 作成日	: 2024/08/01
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#include "SkinningMesh.h" 


namespace Mesh {

	//--------------------------------------------------------------------------------------
	SkinningMesh::SkinningMesh()
		: Mesh()
	{
		m_SkinningData.clear();
		m_BoneData.clear();
		m_BoneDataHashmap.clear();
	}
}