//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// 陰などがない基本的なシェーダー
// 
// 製作者	: amateurK
// 作成日	: 2024/04/21
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

//--------------------------------------------------------------------------------------
// Constant Buffer Variables
//--------------------------------------------------------------------------------------
cbuffer ChangesFrame : register(b0)
{
    matrix matrixWVP;
}

//--------------------------------------------------------------------------------------
// Vertex Shader
//--------------------------------------------------------------------------------------
void VS(
    in float4 inPos : POSITION,
    in float4 inColor : COLOR,
    out float4 outPos : SV_POSITION,
    out float4 outColor : COLOR0
)
{
    outPos = mul(inPos, matrixWVP);
    outColor = inColor;
}

//--------------------------------------------------------------------------------------
// Pixel Shader
//--------------------------------------------------------------------------------------
void PS(
    in float4 inPos : SV_POSITION,
    in float4 inColor : COLOR0,
    out float4 outColor : SV_TARGET
)
{
    outColor = inColor;
}